{
  "irVersion": "1.0",
  "project": "omnillm",
  "repository": "https://github.com/plexusone/omnillm",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.15.5",
      "date": "2026-06-15",
      "fixed": [
        { "description": "Pin `anthropic-sdk-go` to v1.45.0 via replace directive to fix jsonschema incompatibility" }
      ],
      "dependencies": [
        { "description": "`github.com/plexusone/omni-google` v0.5.0 (Gemini Live API)", "commit": "1fa2214" },
        { "description": "`github.com/plexusone/omni-openai` v0.3.0 (Realtime API support)", "commit": "1fa2214" },
        { "description": "`github.com/plexusone/omnillm-core` v0.17.0", "commit": "1fa2214" }
      ],
      "documentation": [
        { "description": "Update thick provider module names to omni-* in README and docs" }
      ]
    },
    {
      "version": "v0.15.4",
      "date": "2026-05-24",
      "fixed": [
        { "description": "Exclude `invopop/jsonschema` v0.14.0 due to incompatibility with `anthropic-sdk-go`" }
      ],
      "dependencies": [
        { "description": "`github.com/plexusone/omni-anthropic` v0.2.1 (was v0.2.0)" },
        { "description": "`github.com/plexusone/omni-aws` v0.8.1 (was v0.8.0)" },
        { "description": "`github.com/plexusone/omni-google` v0.4.1 (was v0.4.0)" },
        { "description": "`github.com/plexusone/omni-openai` v0.2.2 (was v0.2.1)" },
        { "description": "`github.com/plexusone/omnillm-core` v0.16.0 (was v0.15.0)" },
        { "description": "`github.com/anthropics/anthropic-sdk-go` v1.45.0 (was v1.38.0)" }
      ]
    },
    {
      "version": "v0.15.3",
      "date": "2026-04-25",
      "highlights": [
        { "description": "Complete migration to consolidated omni-* provider modules" }
      ],
      "changed": [
        { "description": "Replace `omnillm-anthropic` with `omni-anthropic/omnillm`", "commit": "c533ab5" },
        { "description": "Replace `omnillm-bedrock` with `omni-aws/omnillm`", "commit": "e1c09cb" },
        { "description": "Replace `omnillm-gemini` with `omni-google/omnillm`", "commit": "e1c09cb" }
      ],
      "dependencies": [
        { "description": "`github.com/plexusone/omni-anthropic` v0.2.0 (was omnillm-anthropic v0.1.0)", "commit": "c533ab5" },
        { "description": "`github.com/plexusone/omni-aws` v0.7.0 (was omnillm-bedrock v0.5.0)", "commit": "e1c09cb" },
        { "description": "`github.com/plexusone/omni-google` v0.3.0 (was omnillm-gemini v0.1.0)", "commit": "e1c09cb" }
      ]
    },
    {
      "version": "v0.15.2",
      "date": "2026-04-19",
      "commit": "e1619fa",
      "highlights": [
        { "description": "Update to consolidated OpenAI provider module" }
      ],
      "changed": [
        { "description": "Replace `omnillm-openai` with `omni-openai/omnillm`", "commit": "6ce6516" }
      ],
      "dependencies": [
        { "description": "`github.com/plexusone/omni-openai` v0.2.0 (was omnillm-openai v0.1.0)", "commit": "6ce6516" }
      ],
      "fixed": [
        { "description": "Fix `gofmt` lint errors", "commit": "e1619fa" }
      ],
      "documentation": [
        { "description": "Update README shields", "commit": "f93fad5" }
      ]
    },
    {
      "version": "v0.15.1",
      "date": "2026-04-12",
      "commit": "d8a3f59",
      "highlights": [
        { "description": "Batteries-included OmniLLM aggregator with thick providers" },
        { "description": "Import once for OpenAI, Anthropic, Gemini, and Bedrock SDK-based providers" }
      ],
      "added": [
        { "description": "Aggregator package importing thick providers (OpenAI, Anthropic, Gemini, Bedrock)", "commit": "8e9e85c" },
        { "description": "Provider subpackage for API compatibility with omnillm-core", "commit": "8e9e85c" },
        { "description": "Re-export `ObservabilityHook` and `LLMCallInfo` types", "commit": "8e9e85c" }
      ],
      "dependencies": [
        { "description": "`github.com/plexusone/omnillm-core` v0.15.0", "commit": "9584256" },
        { "description": "`github.com/plexusone/omnillm-openai` v0.1.0", "commit": "9584256" },
        { "description": "`github.com/plexusone/omnillm-anthropic` v0.1.0", "commit": "9584256" },
        { "description": "`github.com/plexusone/omnillm-gemini` v0.1.0", "commit": "9584256" },
        { "description": "`github.com/plexusone/omnillm-bedrock` v0.5.0", "commit": "9584256" }
      ],
      "documentation": [
        { "description": "README with feature support table", "commit": "309e83f" }
      ],
      "internal": [
        { "description": "Add shared CI workflows", "commit": "e4dc9aa" },
        { "description": "Add LICENSE file", "commit": "fd1ba2d" }
      ]
    }
  ]
}
